#### Data Scraping for WORLD WIDE Data

In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np

In [2]:
url="https://www.worldometers.info/coronavirus/"

In [3]:
response=requests.get(url)
print (response)

<Response [200]>

In [4]:
####Parsing HTML
soup=BeautifulSoup(response.content, "html.parser")

In [5]:
#### Title of the page
Title = soup.title
print(Title)

<title>Coronavirus Update (Live): 8,585,194 Cases and 456,439 Deaths from COVID-19 Virus Pandemic - Worldometer</title>

In [6]:
## Active cases
divsActiveCases=soup.find("div", class_="panel_flip")
for i in divsActiveCases.find_all("div", class_="panel_front"):
    print(i.text)

3,594,096
Currently Infected Patients


3,539,536 (98%)
in Mild Condition

54,560 (2%)
Serious or Critical


Show Graph

In [7]:
## Table details
coronatable=soup.find_all("table")

In [8]:
len(coronatable)

3

In [9]:
co=coronatable[0]

In [10]:
country=[] ##Parse first row as Header
total_cases=[]
new_cases=[]
rows=co.find_all("tr")[9:-8]
for row in rows:
    col=row.find_all("td")
    country.append(col[1].text.strip())
    total_cases.append(col[2].text.strip())
    new_cases.append(col[3].text.strip())    
print(country)
print(total_cases)
print(new_cases)

['USA', 'Brazil', 'Russia', 'India', 'UK', 'Spain', 'Peru', 'Italy', 'Chile', 'Iran', 'Germany', 'Turkey', 'Mexico', 'Pakistan', 'France', 'Saudi Arabia', 'Bangladesh', 'Canada', 'Qatar', 'South Africa', 'Belgium', 'Colombia', 'Belarus', 'Sweden', 'Egypt', 'Netherlands', 'Ecuador', 'UAE', 'Indonesia', 'Singapore', 'Portugal', 'Kuwait', 'Argentina', 'Ukraine', 'Switzerland', 'Poland', 'Philippines', 'Afghanistan', 'Oman', 'Iraq', 'Ireland', 'Dominican Republic', 'Panama', 'Romania', 'Bolivia', 'Bahrain', 'Israel', 'Armenia', 'Nigeria', 'Japan', 'Austria', 'Kazakhstan', 'Moldova', 'Ghana', 'Serbia', 'Denmark', 'S. Korea', 'Guatemala', 'Algeria', 'Azerbaijan', 'Honduras', 'Cameroon', 'Czechia', 'Morocco', 'Norway', 'Malaysia', 'Sudan', 'Nepal', 'Australia', 'Finland', 'Ivory Coast', 'Uzbekistan', 'Senegal', 'DRC', 'Tajikistan', 'Haiti', 'Guinea', 'North Macedonia', 'Djibouti', 'Gabon', 'Kenya', 'El Salvador', 'Luxembourg', 'Hungary', 'Ethiopia', 'Bulgaria', 'Venezuela', 'Greece', 'Bosnia and Herzegovina', 'Thailand', 'Kyrgyzstan', 'Somalia', 'CAR', 'Mauritania', 'Mayotte', 'Cuba', 'Croatia', 'Maldives', 'Estonia', 'Sri Lanka', 'Costa Rica', 'Mali', 'South Sudan', 'Nicaragua', 'Iceland', 'Albania', 'Lithuania', 'French Guiana', 'Equatorial Guinea', 'Slovakia', 'Slovenia', 'New Zealand', 'Lebanon', 'Guinea-Bissau', 'Zambia', 'Madagascar', 'Paraguay', 'Sierra Leone', 'Tunisia', 'Hong Kong', 'Latvia', 'Niger', 'Jordan', 'Cyprus', 'Yemen', 'Burkina Faso', 'Georgia', 'Congo', 'Andorra', 'Chad', 'Uruguay', 'Cabo Verde', 'Uganda', 'Diamond Princess', 'San Marino', 'Sao Tome and Principe', 'Malta', 'Mozambique', 'Rwanda', 'Jamaica', 'Palestine', 'Benin', 'Malawi', 'Eswatini', 'Channel Islands', 'Togo', 'Liberia', 'Libya', 'Tanzania', 'Réunion', 'Zimbabwe', 'Taiwan', 'Vietnam', 'Mauritius', 'Montenegro', 'Isle of Man', 'Myanmar', 'Suriname', 'Martinique', 'Comoros', 'Mongolia', 'Cayman Islands', 'Syria', 'Faeroe Islands', 'Guyana', 'Gibraltar', 'Guadeloupe', 'Angola', 'Bermuda', 'Eritrea', 'Brunei', 'Cambodia', 'Trinidad and Tobago', 'Bahamas', 'Burundi', 'Aruba', 'Monaco', 'Barbados', 'Liechtenstein', 'Botswana', 'Sint Maarten', 'Bhutan', 'French Polynesia', 'Macao', 'Saint Martin', 'Namibia', 'Gambia', 'St. Vincent Grenadines', 'Antigua and Barbuda', 'Timor-Leste', 'Curaçao', 'Grenada', 'Belize', 'New Caledonia', 'Laos', 'Saint Lucia', 'Dominica', 'Fiji', 'Saint Kitts and Nevis', 'Falkland Islands', 'Greenland', 'Turks and Caicos', 'Vatican City', 'Montserrat', 'Seychelles', 'MS Zaandam', 'Western Sahara', 'British Virgin Islands', 'Papua New Guinea', 'Caribbean Netherlands', 'St. Barth', 'Lesotho', 'Anguilla', 'Saint Pierre Miquelon', 'China']
['2,263,749', '983,359', '561,091', '381,485', '300,469', '292,348', '244,388', '238,159', '225,103', '197,647', '190,126', '184,031', '165,455', '165,062', '158,641', '145,991', '102,292', '100,220', '84,441', '83,890', '60,348', '60,217', '56,657', '56,043', '50,437', '49,319', '49,097', '43,752', '42,762', '41,473', '38,089', '38,074', '37,510', '34,063', '31,200', '31,015', '27,799', '27,532', '26,818', '25,717', '25,355', '24,645', '23,351', '23,080', '21,499', '20,430', '20,036', '18,698', '18,480', '17,668', '17,223', '16,351', '13,106', '12,929', '12,616', '12,344', '12,306', '11,868', '11,385', '11,329', '10,739', '10,638', '10,280', '9,074', '8,708', '8,529', '8,020', '7,848', '7,409', '7,119', '6,444', '5,855', '5,475', '5,283', '5,279', '4,916', '4,841', '4,664', '4,557', '4,340', '4,257', '4,200', '4,091', '4,079', '3,954', '3,674', '3,483', '3,227', '3,174', '3,146', '2,789', '2,719', '2,605', '2,424', '2,383', '2,295', '2,269', '2,137', '1,977', '1,947', '1,939', '1,906', '1,830', '1,823', '1,816', '1,788', '1,784', '1,758', '1,664', '1,562', '1,511', '1,507', '1,495', '1,492', '1,416', '1,403', '1,330', '1,272', '1,132', '1,125', '1,108', '1,020', '1,001', '985', '909', '899', '895', '883', '855', '854', '850', '823', '741', '712', '696', '688', '663', '662', '646', '638', '600', '597', '592', '586', '570', '547', '542', '510', '509', '502', '463', '446', '342', '337', '337', '336', '286', '277', '221', '210', '204', '193', '187', '187', '183', '176', '171', '166', '144', '142', '141', '129', '123', '104', '104', '101', '99', '97', '82', '79', '77', '67', '60', '45', '42', '39', '36', '29', '26', '24', '23', '23', '22', '21', '19', '19', '18', '18', '15', '13', '13', '12', '12', '11', '11', '9', '9', '8', '8', '7', '6', '4', '3', '1', '83,325']
['+98', '', '', '+394', '', '', '', '', '', '', '', '', '+5,662', '+4,944', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+814', '', '', '', '', '', '', '+474', '', '', '', '', '+49', '+617', '', '', '+440', '+774', '', '', '', '', '', '', '+18', '', '', '+88', '', '', '', '+228', '', '', '', '', '', '', '', '', '', '', '', '', '', '+5', '+132', '', '', '', '', '', '', '', '', '+1', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+2', '', '', '', '', '', '', '', '', '', '', '', '', '+12', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+23', '', '', '', '+3', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '+32']

In [11]:
####Create a Dataframe

df=pd.DataFrame(list(zip(country, total_cases,new_cases)), columns=["Country","Total_Cases","New_Cases"])
df

                   Country Total_Cases New_Cases
0                      USA   2,263,749       +98
1                   Brazil     983,359
2                   Russia     561,091
3                    India     381,485      +394
4                       UK     300,469
..                     ...         ...       ...
210              St. Barth           6
211                Lesotho           4
212               Anguilla           3
213  Saint Pierre Miquelon           1
214                  China      83,325       +32

[215 rows x 3 columns]

In [12]:
df.dtypes

Country        object
Total_Cases    object
New_Cases      object
dtype: object

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Country      215 non-null    object
 1   Total_Cases  215 non-null    object
 2   New_Cases    215 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB

In [14]:
df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
df.replace(np.nan,0, inplace=True)
df

                   Country Total_Cases New_Cases
0                      USA   2,263,749       +98
1                   Brazil     983,359         0
2                   Russia     561,091         0
3                    India     381,485      +394
4                       UK     300,469         0
..                     ...         ...       ...
210              St. Barth           6         0
211                Lesotho           4         0
212               Anguilla           3         0
213  Saint Pierre Miquelon           1         0
214                  China      83,325       +32

[215 rows x 3 columns]

In [15]:
new_cases1=[]
for i in df["New_Cases"]:
    s=str(i)
    s1=s.replace("+","")
    s2=s1.replace(",","")
    s3=int(s2)
    new_cases1.append(s3)
    
print(new_cases1)

[98, 0, 0, 394, 0, 0, 0, 0, 0, 0, 0, 0, 5662, 4944, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 814, 0, 0, 0, 0, 0, 0, 474, 0, 0, 0, 0, 49, 617, 0, 0, 440, 774, 0, 0, 0, 0, 0, 0, 18, 0, 0, 88, 0, 0, 0, 228, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 132, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32]

In [16]:
df=pd.DataFrame(list(zip(country, total_cases,new_cases1)), columns=["Country","Total_Cases","New_Cases"])
df

                   Country Total_Cases  New_Cases
0                      USA   2,263,749         98
1                   Brazil     983,359          0
2                   Russia     561,091          0
3                    India     381,485        394
4                       UK     300,469          0
..                     ...         ...        ...
210              St. Barth           6          0
211                Lesotho           4          0
212               Anguilla           3          0
213  Saint Pierre Miquelon           1          0
214                  China      83,325         32

[215 rows x 3 columns]

In [17]:
df.dtypes

Country        object
Total_Cases    object
New_Cases       int64
dtype: object

#### Data Scraping and Cleaning for INDIA data

In [18]:
country=[] ##Parse first row as Header
total_cases=[]
new_cases=[]
rows=co.find_all("tr")[12:13]

for row in rows:
    col=row.find_all("td")
    country.append(col[1].text.strip())
    total_cases.append(col[2].text.strip())
    new_cases.append(col[3].text.strip())    
print(country)
print(total_cases)
print(new_cases)

['India']
['381,485']
['+394']

In [19]:
####Create a Dataframe

df=pd.DataFrame(list(zip(country, total_cases,new_cases)), columns=["Country","Total_Cases","New_Cases"])
df

  Country Total_Cases New_Cases
0   India     381,485      +394

In [20]:
df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
df.replace(np.nan,0, inplace=True)
df

  Country Total_Cases New_Cases
0   India     381,485      +394

In [21]:
new_cases1=[]
for i in df["New_Cases"]:
    s=str(i)
    s1=s.replace("+","")
    s2=s1.replace(",","")
    s3=int(s2)
    new_cases1.append(s3)
    
print(new_cases1)

[394]

In [22]:
df=pd.DataFrame(list(zip(country, total_cases,new_cases1)), columns=["Country","Total_Cases","New_Cases"])
df

  Country Total_Cases  New_Cases
0   India     381,485        394

#### Data Scraping and Cleaning for WORLD data

In [23]:
country=[] ##Parse first row as Header
total_cases=[]
new_cases=[]
rows=co.find_all("tr")[8:9]

for row in rows:
    col=row.find_all("td")
    country.append(col[1].text.strip())
    total_cases.append(col[2].text.strip())
    new_cases.append(col[3].text.strip())    
print(country)
print(total_cases)
print(new_cases)

['World']
['8,585,194']
['+14,810']

In [24]:
####Create a Dataframe

df=pd.DataFrame(list(zip(country, total_cases,new_cases)), columns=["Country","Total_Cases","New_Cases"])
df

  Country Total_Cases New_Cases
0   World   8,585,194   +14,810

In [25]:
df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
df.replace(np.nan,0, inplace=True)
df

  Country Total_Cases New_Cases
0   World   8,585,194   +14,810

In [26]:
new_cases1=[]
for i in df["New_Cases"]:
    s=str(i)
    s1=s.replace("+","")
    s2=s1.replace(",","")
    s3=int(s2)
    new_cases1.append(s3)
    
print(new_cases1)

[14810]

In [27]:
df=pd.DataFrame(list(zip(country, total_cases,new_cases1)), columns=["Country","Total_Cases","New_Cases"])
df

  Country Total_Cases  New_Cases
0   World   8,585,194      14810

#### Q3: Find more data across the internet and write about various features that you’d like to do an analysis upon

In [ ]:
######COVID19 Testing data Set - 
This should cover 
1. How many tests does a country do to find one COVID-19 case?
2. daily number of tests against the daily number of new confirmed cases, per million people.
3. total tests performed relative to the size of population
and many such aspects related to testing of COVID19 cases
#######Mortality Rate dataset-
1. Worldwide
2. Country wise
3. India
#######Sysmptoms -
1. Sysmptom in diferent stages (day wise symptoms)